performance/reports/runs/normal-day-2026-09-02T08-48-19/summary.txt
     ✓ login 200
     ✓ unread count 200
     ✓ board list 200
     ✓ notif list 200
     ✓ chat rooms 200
     ✓ read all 200
     ✓ hot daily 200
     ✓ chat messages 200
     ✓ post detail 200
     ✓ post list 200
     ✓ chat read 200
     ✓ comment list 200
     ✓ comment reaction 200
     ✓ friend list 200
     ✓ meal today 200
     ✓ scrap 2xx
     ✓ read one 200
     ✓ post reaction 2xx
     ✓ timetable today 200
     ✓ post search 200
     ✓ comment create 2xx
     ✓ user info 200
     ✓ ws handshake 101
     ✓ my posts 200
     ✗ post create 2xx
      ↳  99% — ✓ 105 / ✗ 1
     ✓ meal month 200
     ✓ logout 200
     ✓ received reqs 200
     ✓ post update 200
     ✓ post delete 200
     ✓ refresh 200

     auth_token_refreshes.............: 20      0.033161/s
     chat_ws_messages_sent............: 1398    2.317935/s
     chat_ws_rtt......................: avg=169.69ms min=15ms    med=27ms     max=5.11s    p(90)=44ms     p(95)=1.29s    p(99)=3.37s   
     checks...........................: 99.98%  ✓ 7170      ✗ 1    
     ✓ { phase:measure }..............: 100.00% ✓ 4722      ✗ 0    
     ✓ { phase:rampdown }.............: 100.00% ✓ 1021      ✗ 0    
     ✓ { phase:warmup }...............: 99.92%  ✓ 1427      ✗ 1    
     data_received....................: 302 MB  501 kB/s
     data_sent........................: 3.6 MB  5.9 kB/s
     http_req_blocked.................: avg=179.88µs min=1.28µs  med=7.07µs   max=696.42ms p(90)=17.37µs  p(95)=20.42µs  p(99)=366.87µs
     http_req_connecting..............: avg=8.08µs   min=0s      med=0s       max=13.02ms  p(90)=0s       p(95)=0s       p(99)=232.61µs
     http_req_duration................: avg=97.56ms  min=2.12ms  med=10.5ms   max=5.77s    p(90)=76.3ms   p(95)=154.01ms p(99)=2.76s   
       { expected_response:true }.....: avg=97.41ms  min=2.12ms  med=10.5ms   max=5.77s    p(90)=76ms     p(95)=153.83ms p(99)=2.76s   
     ✓ { feature:auth }...............: avg=129.03ms min=15.19ms med=92.56ms  max=3.3s     p(90)=116.65ms p(95)=124.68ms p(99)=1.48s   
     ✓ { feature:board }..............: avg=100.56ms min=2.26ms  med=5.9ms    max=5.11s    p(90)=10.67ms  p(95)=518.11ms p(99)=2.31s   
     ✓ { feature:chat }...............: avg=114.29ms min=2.79ms  med=9.73ms   max=5.22s    p(90)=23.87ms  p(95)=399.54ms p(99)=3.1s    
     ✓ { feature:comment }............: avg=76.8ms   min=2.21ms  med=21.26ms  max=5.77s    p(90)=136.82ms p(95)=159.72ms p(99)=325.55ms
     ✓ { feature:friend }.............: avg=68.7ms   min=3.09ms  med=6.49ms   max=4.23s    p(90)=11.52ms  p(95)=13.89ms  p(99)=1.57s   
     ✓ { feature:hot }................: avg=92.35ms  min=8.22ms  med=15.84ms  max=3.87s    p(90)=27.36ms  p(95)=30.32ms  p(99)=2.61s   
     ✓ { feature:mypage }.............: avg=105.44ms min=2.51ms  med=6.27ms   max=2.49s    p(90)=12.51ms  p(95)=158.1ms  p(99)=2.45s   
     ✓ { feature:notification }.......: avg=68.2ms   min=2.52ms  med=10.68ms  max=3.37s    p(90)=28.11ms  p(95)=81.78ms  p(99)=1.41s   
     ✓ { feature:post }...............: avg=100.13ms min=2.12ms  med=8.99ms   max=5.38s    p(90)=31.56ms  p(95)=99.43ms  p(99)=2.9s    
     ✓ { feature:reaction }...........: avg=45.53ms  min=17.04ms med=30.14ms  max=1.14s    p(90)=44.45ms  p(95)=48.23ms  p(99)=441.13ms
     ✓ { feature:school }.............: avg=202.81ms min=2.91ms  med=7.35ms   max=3.76s    p(90)=207.23ms p(95)=1.57s    p(99)=2.99s   
     ✓ { feature:scrap }..............: avg=413.01ms min=17.04ms med=29.74ms  max=5.26s    p(90)=327.17ms p(95)=3.62s    p(99)=5.14s   
     ✓ { feature:timetable }..........: avg=6.48ms   min=2.3ms   med=5.73ms   max=23.43ms  p(90)=10.01ms  p(95)=10.39ms  p(99)=18.35ms 
     ✓ { name:board_list }............: avg=100.56ms min=2.26ms  med=5.9ms    max=5.11s    p(90)=10.67ms  p(95)=518.11ms p(99)=2.31s   
     ✓ { name:chat_mark_read }........: avg=87.65ms  min=3.09ms  med=9.75ms   max=3.62s    p(90)=30.53ms  p(95)=41.52ms  p(99)=2.79s   
     ✓ { name:chat_messages }.........: avg=118.36ms min=3.78ms  med=8.68ms   max=3.99s    p(90)=15.65ms  p(95)=177.23ms p(99)=3.19s   
     ✓ { name:chat_read_status }......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:chat_rooms }............: avg=122.74ms min=2.79ms  med=9.87ms   max=5.22s    p(90)=18.69ms  p(95)=543.92ms p(99)=2.99s   
     ✓ { name:comment_create }........: avg=93.75ms  min=27.83ms med=43.49ms  max=3.55s    p(90)=59.08ms  p(95)=64.54ms  p(99)=1.08s   
     ✓ { name:comment_delete }........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:comment_list }..........: avg=75.64ms  min=2.21ms  med=18.08ms  max=5.77s    p(90)=138.96ms p(95)=161.41ms p(99)=321.73ms
     ✓ { name:comment_reaction }......: avg=33.65ms  min=17.04ms med=22.92ms  max=222.9ms  p(90)=38.52ms  p(95)=69.42ms  p(99)=185.48ms
     ✓ { name:comment_update }........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:friend_list }...........: avg=27.8ms   min=3.09ms  med=6.21ms   max=1.27s    p(90)=11.88ms  p(95)=14.46ms  p(99)=511.74ms
     ✓ { name:friend_req_received }...: avg=176.67ms min=3.32ms  med=8.41ms   max=4.23s    p(90)=11.41ms  p(95)=11.8ms   p(99)=3.22s   
     ✓ { name:friend_request }........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:friend_respond }........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:friend_search }.........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:hot_daily }.............: avg=92.35ms  min=8.22ms  med=15.84ms  max=3.87s    p(90)=27.36ms  p(95)=30.32ms  p(99)=2.61s   
     ✓ { name:login }.................: avg=101.26ms min=82.87ms med=95.4ms   max=422.66ms p(90)=116.65ms p(95)=121.6ms  p(99)=145.56ms
     ✓ { name:logout }................: avg=265.66ms min=15.19ms med=24.81ms  max=3.3s     p(90)=188.23ms p(95)=1.67s    p(99)=2.97s   
     ✓ { name:meal_month }............: avg=6.08ms   min=2.91ms  med=4.73ms   max=12.77ms  p(90)=10.5ms   p(95)=11.64ms  p(99)=12.55ms 
     ✓ { name:meal_today }............: avg=232.32ms min=3.72ms  med=7.74ms   max=3.76s    p(90)=466.71ms p(95)=1.76s    p(99)=3.09s   
     ✓ { name:my_comments }...........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:my_posts }..............: avg=173.05ms min=2.65ms  med=6.59ms   max=2.49s    p(90)=12.86ms  p(95)=1.76s    p(99)=2.47s   
     ✓ { name:notif_list }............: avg=24.89ms  min=6.05ms  med=15.7ms   max=552.93ms p(90)=24.84ms  p(95)=30.11ms  p(99)=197.9ms 
     ✓ { name:notif_read_all }........: avg=28.31ms  min=4.38ms  med=27ms     max=79.77ms  p(90)=32.61ms  p(95)=47.24ms  p(99)=73.27ms 
     ✓ { name:notif_read_one }........: avg=69.33ms  min=3.82ms  med=20.02ms  max=1.06s    p(90)=30.27ms  p(95)=248.96ms p(99)=925.92ms
     ✓ { name:notif_unread_count }....: avg=96.26ms  min=2.52ms  med=6.78ms   max=3.37s    p(90)=13.45ms  p(95)=730.91ms p(99)=1.71s   
     ✓ { name:post_create }...........: avg=188.03ms min=15.55ms med=26.5ms   max=3.97s    p(90)=48.88ms  p(95)=1.67s    p(99)=2.43s   
     ✓ { name:post_delete }...........: avg=39.09ms  min=15.04ms med=21.99ms  max=299.39ms p(90)=36.68ms  p(95)=84.78ms  p(99)=256.47ms
     ✓ { name:post_detail }...........: avg=90.21ms  min=3.59ms  med=9.03ms   max=5.38s    p(90)=16.67ms  p(95)=22.49ms  p(99)=2.74s   
     ✓ { name:post_list_deep }........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:post_list }.............: avg=89.92ms  min=2.12ms  med=6.48ms   max=3.63s    p(90)=38.24ms  p(95)=89.34ms  p(99)=2.78s   
     ✓ { name:post_reaction }.........: avg=49.07ms  min=18.23ms med=32ms     max=1.14s    p(90)=44.65ms  p(95)=47.14ms  p(99)=544.4ms 
     ✓ { name:post_search }...........: avg=329.93ms min=75.88ms med=90.25ms  max=4.2s     p(90)=351.03ms p(95)=2.16s    p(99)=3.95s   
     ✓ { name:post_update }...........: avg=304.93ms min=15.26ms med=23.96ms  max=5.06s    p(90)=40.7ms   p(95)=794.41ms p(99)=4.21s   
     ✓ { name:school_search }.........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:scrap_list }............: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:scrap_toggle }..........: avg=413.01ms min=17.04ms med=29.74ms  max=5.26s    p(90)=327.17ms p(95)=3.62s    p(99)=5.14s   
     ✓ { name:subject_list }..........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:template_list }.........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:timetable_today }.......: avg=6.48ms   min=2.3ms   med=5.73ms   max=23.43ms  p(90)=10.01ms  p(95)=10.39ms  p(99)=18.35ms 
     ✓ { name:token_refresh }.........: avg=159ms    min=18.52ms med=24.63ms  max=1.42s    p(90)=165.58ms p(95)=1.3s     p(99)=1.39s   
     ✓ { name:user_info }.............: avg=37.82ms  min=2.51ms  med=5.66ms   max=1.38s    p(90)=12.27ms  p(95)=33.89ms  p(99)=773.94ms
     ✓ { op:auth }....................: avg=129.03ms min=15.19ms med=92.56ms  max=3.3s     p(90)=116.65ms p(95)=124.68ms p(99)=1.48s   
     ✗ { op:read,phase:measure }......: avg=100.86ms min=2.12ms  med=9.39ms   max=5.41s    p(90)=62.5ms   p(95)=298.03ms p(99)=2.7s    
     ✗ { op:write,phase:measure }.....: avg=137.89ms min=3.09ms  med=24.19ms  max=5.26s    p(90)=46.04ms  p(95)=207.77ms p(99)=3.55s   
     ✓ { page:0 }.....................: avg=113.36ms min=2.36ms  med=6.92ms   max=3.63s    p(90)=41.46ms  p(95)=359.64ms p(99)=2.97s   
     ✓ { page:1 }.....................: avg=29.97ms  min=2.12ms  med=5.82ms   max=2.34s    p(90)=29.83ms  p(95)=36.87ms  p(99)=68.89ms 
     ✓ { page:2 }.....................: avg=60.31ms  min=2.29ms  med=6.04ms   max=2.77s    p(90)=36.52ms  p(95)=51.4ms   p(99)=1.54s   
     ✓ { page:3 }.....................: avg=130.51ms min=2.96ms  med=6.84ms   max=2.36s    p(90)=45.47ms  p(95)=835.2ms  p(99)=2.05s   
     ✓ { page:4 }.....................: avg=96.71ms  min=2.54ms  med=4.62ms   max=3.04s    p(90)=21.44ms  p(95)=25.83ms  p(99)=2.05s   
     ✓ { phase:measure }..............: avg=104.54ms min=2.12ms  med=9.97ms   max=5.41s    p(90)=60.84ms  p(95)=296.48ms p(99)=2.76s   
     ✓ { phase:rampdown }.............: avg=80.64ms  min=2.36ms  med=9.14ms   max=5.77s    p(90)=42.93ms  p(95)=97.14ms  p(99)=2.16s   
     ✓ { phase:warmup }...............: avg=86.73ms  min=3.05ms  med=13.03ms  max=5.38s    p(90)=93.44ms  p(95)=121.99ms p(99)=3.76s   
     http_req_failed..................: 0.01%   ✓ 1         ✗ 6926 
     ✓ { phase:measure }..............: 0.00%   ✓ 0         ✗ 4549 
     ✓ { phase:rampdown }.............: 0.00%   ✓ 0         ✗ 986  
     ✓ { phase:warmup }...............: 0.07%   ✓ 1         ✗ 1391 
     http_req_receiving...............: avg=644.32µs min=0s      med=242.67µs max=89.98ms  p(90)=614.07µs p(95)=1.58ms   p(99)=12.96ms 
     http_req_sending.................: avg=540.51µs min=3.95µs  med=39.77µs  max=3.15s    p(90)=109.36µs p(95)=127.49µs p(99)=236.68µs
     http_req_tls_handshaking.........: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting.................: avg=96.37ms  min=2.01ms  med=10.11ms  max=5.77s    p(90)=72.31ms  p(95)=142.35ms p(99)=2.76s   
     http_reqs........................: 6927    11.485219/s
     ✓ { feature:auth }...............: 160     0.265286/s
     ✓ { feature:board }..............: 594     0.984874/s
     ✓ { feature:chat }...............: 911     1.510471/s
     ✓ { feature:comment }............: 1124    1.863633/s
     ✓ { feature:friend }.............: 91      0.150881/s
     ✓ { feature:hot }................: 594     0.984874/s
     ✓ { feature:mypage }.............: 102     0.16912/s
     ✓ { feature:notification }.......: 280     0.46425/s
     ✓ { feature:post }...............: 2824    4.682295/s
     ✓ { feature:reaction }...........: 122     0.20228/s
     ✓ { feature:school }.............: 46      0.07627/s
     ✓ { feature:scrap }..............: 39      0.064663/s
     ✓ { feature:timetable }..........: 40      0.066321/s
     ✓ { name:board_list }............: 594     0.984874/s
     ✓ { name:chat_mark_read }........: 195     0.323317/s
     ✓ { name:chat_messages }.........: 195     0.323317/s
     ✓ { name:chat_read_status }......: 0       0/s
     ✓ { name:chat_rooms }............: 521     0.863837/s
     ✓ { name:comment_create }........: 72      0.119379/s
     ✓ { name:comment_delete }........: 0       0/s
     ✓ { name:comment_list }..........: 1052    1.744254/s
     ✓ { name:comment_reaction }......: 28      0.046425/s
     ✓ { name:comment_update }........: 0       0/s
     ✓ { name:friend_list }...........: 66      0.10943/s
     ✓ { name:friend_req_received }...: 25      0.041451/s
     ✓ { name:friend_request }........: 0       0/s
     ✓ { name:friend_respond }........: 0       0/s
     ✓ { name:friend_search }.........: 0       0/s
     ✓ { name:hot_daily }.............: 594     0.984874/s
     ✓ { name:login }.................: 120     0.198964/s
     ✓ { name:logout }................: 20      0.033161/s
     ✓ { name:meal_month }............: 6       0.009948/s
     ✓ { name:meal_today }............: 40      0.066321/s
     ✓ { name:my_comments }...........: 0       0/s
     ✓ { name:my_posts }..............: 51      0.08456/s
     ✓ { name:notif_list }............: 83      0.137617/s
     ✓ { name:notif_read_all }........: 15      0.024871/s
     ✓ { name:notif_read_one }........: 34      0.056373/s
     ✓ { name:notif_unread_count }....: 148     0.245389/s
     ✓ { name:post_create }...........: 106     0.175752/s
     ✓ { name:post_delete }...........: 18      0.029845/s
     ✓ { name:post_detail }...........: 2026    3.359182/s
     ✓ { name:post_list_deep }........: 0       0/s
     ✓ { name:post_list }.............: 594     0.984874/s
     ✓ { name:post_reaction }.........: 94      0.155855/s
     ✓ { name:post_search }...........: 62      0.102798/s
     ✓ { name:post_update }...........: 18      0.029845/s
     ✓ { name:school_search }.........: 0       0/s
     ✓ { name:scrap_list }............: 0       0/s
     ✓ { name:scrap_toggle }..........: 39      0.064663/s
     ✓ { name:subject_list }..........: 0       0/s
     ✓ { name:template_list }.........: 0       0/s
     ✓ { name:timetable_today }.......: 40      0.066321/s
     ✓ { name:token_refresh }.........: 20      0.033161/s
     ✓ { name:user_info }.............: 51      0.08456/s
     ✓ { op:auth }....................: 160     0.265286/s
     ✓ { op:read }....................: 6148    10.193608/s
     ✓ { op:write }...................: 619     1.026325/s
     ✓ { page:0 }.....................: 321     0.53223/s
     ✓ { page:1 }.....................: 115     0.190674/s
     ✓ { page:2 }.....................: 84      0.139275/s
     ✓ { page:3 }.....................: 40      0.066321/s
     ✓ { page:4 }.....................: 34      0.056373/s
     ✓ { phase:measure }..............: 4549    7.542408/s
     ✓ { phase:rampdown }.............: 986     1.634824/s
     ✓ { phase:warmup }...............: 1392    2.307987/s
     iteration_duration...............: avg=11.13s   min=1s      med=8.95s    max=30.75s   p(90)=21.43s   p(95)=25.55s   p(99)=29.17s  
     iterations.......................: 1799    2.982808/s
     ✓ { phase:measure }..............: 0       0/s
     ✓ { phase:rampdown }.............: 0       0/s
     ✓ { phase:warmup }...............: 0       0/s
     phase_iterations.................: 1799    2.982808/s
     ✓ { phase:measure }..............: 1193    1.978037/s
     ✓ { phase:rampdown }.............: 284     0.470882/s
     ✓ { phase:warmup }...............: 322     0.533888/s
     vus..............................: 1       min=0       max=63 
     vus_max..........................: 100     min=100     max=100
     ws_connecting....................: avg=22.72ms  min=2.19ms  med=3.89ms   max=3.43s    p(90)=6.4ms    p(95)=24.43ms  p(99)=154.72ms
     ws_msgs_received.................: 1636    2.712548/s
     ws_msgs_sent.....................: 1886    3.127057/s
     ws_session_duration..............: avg=22.77s   min=15.1s   med=22.81s   max=30.74s   p(90)=28.72s   p(95)=29.34s   p(99)=29.8s   
     ws_sessions......................: 244     0.404561/s